In [2]:
# Import Libraries and Dependencies
import pandas as pd

### 1. Combine and Clean the Data
#### Import CSVs

In [3]:
# Read the CSV files into DataFrames.
AS_2020 = pd.read_csv('Resources/athletic_sales_2020.csv')
AS_2021 = pd.read_csv('Resources/athletic_sales_2021.csv')

In [4]:
# Display the 2020 sales DataFrame
AS_2020

,retailer,retailer_id,invoice_date,region,state,city,product,price_per_unit,units_sold,total_sales,operating_profit,sales_method
0,Foot Locker,1185732,1/1/20,Northeast,New York,New York,Men's Street Footwear,50,1200,600000,300000.00,In-store
1,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,68,83,5644,2426.92,Online
2,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,75,275,206250,61875.00,Outlet
3,Foot Locker,1185732,1/1/20,Northeast,New York,New York,Men's Street Footwear,34,384,13056,6789.12,Outlet
4,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,53,83,4399,1407.68,Outlet
...,...,...,...,...,...,...,...,...,...,...,...,...
1292,West Gear,1128299,12/30/20,West,California,San Francisco,Women's Apparel,72,203,14616,3946.32,Online
1293,West Gear,1128299,12/30/20,West,California,San Francisco,Women's Apparel,80,700,560000,84000.00,Outlet
1294,Kohl's,1189833,12/30/20,Midwest,Minnesota,Minneapolis,Women's Street Footwear,41,119,4879,2878.61,Online
1295,Kohl's,1189833,12/30/20,Midwest,Minnesota,Minneapolis,Women's Street Footwear,45,475,213750,96187.50,Outlet
1296,West Gear,1128299,12/30/20,West,California,San Francisco,Women's Apparel,62,245,15190,2886.10,Outlet

In [5]:
# Display the 2021 sales DataFrame
AS_2021

,retailer,retailer_id,invoice_date,region,state,city,product,price_per_unit,units_sold,total_sales,operating_profit,sales_method
0,West Gear,1128299,1/1/21,West,California,San Francisco,Men's Athletic Footwear,65,750,487500,121875.00,Outlet
1,West Gear,1128299,1/1/21,West,California,San Francisco,Men's Athletic Footwear,51,233,11883,3208.41,Outlet
2,Kohl's,1189833,1/1/21,Midwest,Montana,Billings,Men's Apparel,50,275,137500,82500.00,Outlet
3,Kohl's,1189833,1/1/21,Midwest,Montana,Billings,Men's Apparel,47,77,3619,2714.25,Online
4,West Gear,1128299,1/1/21,West,California,San Francisco,Men's Athletic Footwear,64,225,14400,5184.00,Online
...,...,...,...,...,...,...,...,...,...,...,...,...
8341,Foot Locker,1185732,12/31/21,Northeast,Pennsylvania,Philadelphia,Men's Apparel,63,47,2961,1362.06,Online
8342,Foot Locker,1185732,12/31/21,Northeast,Pennsylvania,Philadelphia,Men's Apparel,46,56,2576,1004.64,Outlet
8343,Amazon,1185732,12/31/21,Northeast,Maine,Portland,Men's Apparel,52,36,1872,692.64,Online
8344,Amazon,1185732,12/31/21,Northeast,Maine,Portland,Men's Apparel,55,125,68750,17187.50,Outlet
8345,Foot Locker,1185732,12/31/21,Northeast,Pennsylvania,Philadelphia,Men's Apparel,70,175,122500,42875.00,Outlet

#### Check the data types of each DataFrame

In [6]:
# Check the 2020 sales data types.
AS_2020.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1297 entries, 0 to 1296
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   retailer          1297 non-null   object
 1   retailer_id       1297 non-null   int64
 2   invoice_date      1297 non-null   object
 3   region            1297 non-null   object
 4   state             1297 non-null   object
 5   city              1297 non-null   object
 6   product           1297 non-null   object
 7   price_per_unit    1297 non-null   int64
 8   units_sold        1297 non-null   int64
 9   total_sales       1297 non-null   int64
 10  operating_profit  1297 non-null   float64
 11  sales_method      1297 non-null   object
dtypes: float64(1), int64(4), object(7)
memory usage: 121.7+ KB

In [7]:
# Check the 2021 sales data types.
AS_2021.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8346 entries, 0 to 8345
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   retailer          8346 non-null   object
 1   retailer_id       8346 non-null   int64
 2   invoice_date      8346 non-null   object
 3   region            8346 non-null   object
 4   state             8346 non-null   object
 5   city              8346 non-null   object
 6   product           8346 non-null   object
 7   price_per_unit    8346 non-null   int64
 8   units_sold        8346 non-null   int64
 9   total_sales       8346 non-null   int64
 10  operating_profit  8346 non-null   float64
 11  sales_method      8346 non-null   object
dtypes: float64(1), int64(4), object(7)
memory usage: 782.6+ KB

#### Combine the sales data by rows.

In [8]:
# Combine the 2020 and 2021 sales DataFrames on the rows and reset the index.
AS_2020_2021 = pd.concat([AS_2020, AS_2021], axis="rows", join="inner")

In [9]:
# Check if any values are null.
AS_2020_2021

,retailer,retailer_id,invoice_date,region,state,city,product,price_per_unit,units_sold,total_sales,operating_profit,sales_method
0,Foot Locker,1185732,1/1/20,Northeast,New York,New York,Men's Street Footwear,50,1200,600000,300000.00,In-store
1,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,68,83,5644,2426.92,Online
2,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,75,275,206250,61875.00,Outlet
3,Foot Locker,1185732,1/1/20,Northeast,New York,New York,Men's Street Footwear,34,384,13056,6789.12,Outlet
4,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,53,83,4399,1407.68,Outlet
...,...,...,...,...,...,...,...,...,...,...,...,...
8341,Foot Locker,1185732,12/31/21,Northeast,Pennsylvania,Philadelphia,Men's Apparel,63,47,2961,1362.06,Online
8342,Foot Locker,1185732,12/31/21,Northeast,Pennsylvania,Philadelphia,Men's Apparel,46,56,2576,1004.64,Outlet
8343,Amazon,1185732,12/31/21,Northeast,Maine,Portland,Men's Apparel,52,36,1872,692.64,Online
8344,Amazon,1185732,12/31/21,Northeast,Maine,Portland,Men's Apparel,55,125,68750,17187.50,Outlet
8345,Foot Locker,1185732,12/31/21,Northeast,Pennsylvania,Philadelphia,Men's Apparel,70,175,122500,42875.00,Outlet

In [10]:
# Check the data type of each column
AS_2020_2021.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9643 entries, 0 to 8345
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   retailer          9643 non-null   object
 1   retailer_id       9643 non-null   int64
 2   invoice_date      9643 non-null   object
 3   region            9643 non-null   object
 4   state             9643 non-null   object
 5   city              9643 non-null   object
 6   product           9643 non-null   object
 7   price_per_unit    9643 non-null   int64
 8   units_sold        9643 non-null   int64
 9   total_sales       9643 non-null   int64
 10  operating_profit  9643 non-null   float64
 11  sales_method      9643 non-null   object
dtypes: float64(1), int64(4), object(7)
memory usage: 979.4+ KB

In [11]:
# Convert the "invoice_date" to a datetime datatype
AS_2020_2021.invoice_date = pd.to_datetime(AS_2020_2021.invoice_date, format="%m/%d/%y")

In [12]:
# Confirm that the "invoice_date" data type has been changed.
AS_2020_2021.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9643 entries, 0 to 8345
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   retailer          9643 non-null   object
 1   retailer_id       9643 non-null   int64
 2   invoice_date      9643 non-null   datetime64[ns]
 3   region            9643 non-null   object
 4   state             9643 non-null   object
 5   city              9643 non-null   object
 6   product           9643 non-null   object
 7   price_per_unit    9643 non-null   int64
 8   units_sold        9643 non-null   int64
 9   total_sales       9643 non-null   int64
 10  operating_profit  9643 non-null   float64
 11  sales_method      9643 non-null   object
dtypes: datetime64[ns](1), float64(1), int64(4), object(6)
memory usage: 979.4+ KB

### 2. Determine which Region Sold the Most Products

#### Using `groupby`

In [13]:
# Show the number products sold for region, state, and city.
# Rename the sum to "Total_Products_Sold".

AS_2020_2021_REGION_PRODUCTS_GROUPBY = AS_2020_2021.groupby(["region", "state", "city"]).agg({"units_sold": "sum"}).rename(columns={"units_sold": "Total_Products_Sold"})

# Show the top 5 results.
AS_2020_2021_REGION_PRODUCTS_GROUPBY.sort_values("Total_Products_Sold", ascending=False).head(5)

                                    Total_Products_Sold
region    state      city
Northeast New York   New York                    111954
South     Texas      Houston                      90322
West      California San Francisco                85478
                     Los Angeles                  76384
Southeast Florida    Miami                        73135

#### Using `pivot_table`

In [14]:
# Show the number products sold for region, state, and city.

AS_2020_2021_REGION_PRODUCTS_PIVOT = pd.pivot_table(AS_2020_2021, index=["region", "state", "city"], values=["units_sold"], aggfunc=sum)

# Rename the "units_sold" column to "Total_Products_Sold"
AS_2020_2021_REGION_PRODUCTS_PIVOT.rename(columns={"units_sold": "Total_Products_Sold"}, inplace=True)


# Show the top 5 results.
AS_2020_2021_REGION_PRODUCTS_PIVOT.sort_values("Total_Products_Sold", ascending=False).head(5)

C:\Users\richv\AppData\Local\Temp\ipykernel_34180\1320153149.py:3: FutureWarning: The provided callable <built-in function sum> is currently using DataFrameGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  AS_2020_2021_REGION_PRODUCTS_PIVOT = pd.pivot_table(AS_2020_2021, index=["region", "state", "city"], values=["units_sold"], aggfunc=sum)

                                    Total_Products_Sold
region    state      city
Northeast New York   New York                    111954
South     Texas      Houston                      90322
West      California San Francisco                85478
                     Los Angeles                  76384
Southeast Florida    Miami                        73135

### 3. Determine which Region had the Most Sales

#### Using `groupby`

In [15]:
# Show the total sales for the products sold for each region, state, and city.
# Rename the "total_sales" column to "Total Sales"
AS_2020_2021_REGION_SALES_GROUPBY = AS_2020_2021.groupby(["region", "state", "city"]).agg({"total_sales": "sum"})
AS_2020_2021_REGION_SALES_GROUPBY.rename(columns={"total_sales": "Total_Sales"}, inplace=True)

# Show the top 5 results.
AS_2020_2021_REGION_SALES_GROUPBY.sort_values("Total_Sales", ascending=False).head(5)

                                        Total_Sales
region    state          city
Northeast New York       New York          39801235
West      California     San Francisco     33973228
Southeast Florida        Miami             31600863
          South Carolina Charleston        29285637
          Florida        Orlando           27682851

#### Using `pivot_table`

In [16]:
# Show the total sales for the products sold for each region, state, and city.
AS_2020_2021_SALES_PIVOT = pd.pivot_table(AS_2020_2021, index=["region", "state", "city"], values=["total_sales"], aggfunc=sum)


# Optional: Rename the "total_sales" column to "Total Sales"
AS_2020_2021_SALES_PIVOT.rename(columns={"total_sales": "Total_Sales"}, inplace=True)


# Show the top 5 results.
AS_2020_2021_SALES_PIVOT.sort_values("Total_Sales", ascending=False).head(5)

C:\Users\richv\AppData\Local\Temp\ipykernel_34180\1247918557.py:2: FutureWarning: The provided callable <built-in function sum> is currently using DataFrameGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  AS_2020_2021_SALES_PIVOT = pd.pivot_table(AS_2020_2021, index=["region", "state", "city"], values=["total_sales"], aggfunc=sum)

                                        Total_Sales
region    state          city
Northeast New York       New York          39801235
West      California     San Francisco     33973228
Southeast Florida        Miami             31600863
          South Carolina Charleston        29285637
          Florida        Orlando           27682851

### 4. Determine which Retailer had the Most Sales

#### Using `groupby`

In [17]:
# Show the total sales for the products sold for each retailer, region, state, and city.
# Rename the "total_sales" column to "Total Sales"
AS_2020_2021_RETAILER_SALES_GROUPBY = AS_2020_2021.groupby(["retailer","region", "state", "city"]).agg({"total_sales": "sum"})
AS_2020_2021_RETAILER_SALES_GROUPBY.rename(columns={"total_sales": "Total_Sales"}, inplace=True)

# Show the top 5 results.
AS_2020_2021_RETAILER_SALES_GROUPBY.sort_values("Total_Sales", ascending=False).head(5)

                                                    Total_Sales
retailer    region    state          city
West Gear   West      California     San Francisco     32794405
Kohl's      West      California     Los Angeles       25127160
Foot Locker Northeast New York       New York          25008568
West Gear   West      Washington     Seattle           24862675
Foot Locker Southeast South Carolina Charleston        24822280

#### Using `pivot_table`

In [18]:
# Show the total sales for the products sold for each retailer, region, state, and city.
AS_2020_2021_RETAILER_SALES_PIVOT = pd.pivot_table(AS_2020_2021, index=["retailer","region", "state", "city"], values=["total_sales"], aggfunc=sum)

# Optional: Rename the "total_sales" column to "Total Sales"
AS_2020_2021_RETAILER_SALES_PIVOT.rename(columns={"total_sales": "Total_Sales"}, inplace=True)


# Show the top 5 results.
AS_2020_2021_RETAILER_SALES_PIVOT.sort_values("Total_Sales", ascending=False).head(5)

C:\Users\richv\AppData\Local\Temp\ipykernel_34180\3035901863.py:2: FutureWarning: The provided callable <built-in function sum> is currently using DataFrameGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  AS_2020_2021_RETAILER_SALES_PIVOT = pd.pivot_table(AS_2020_2021, index=["retailer","region", "state", "city"], values=["total_sales"], aggfunc=sum)

                                                    Total_Sales
retailer    region    state          city
West Gear   West      California     San Francisco     32794405
Kohl's      West      California     Los Angeles       25127160
Foot Locker Northeast New York       New York          25008568
West Gear   West      Washington     Seattle           24862675
Foot Locker Southeast South Carolina Charleston        24822280

### 5. Determine which Retailer Sold the Most Women's Athletic Footwear

In [19]:
# Filter the sales data to get the women's athletic footwear sales data.
AS_2020_2021_W = AS_2020_2021[AS_2020_2021['product'] == 'Women\'s Apparel']
AS_2020_2021_W

,retailer,retailer_id,invoice_date,region,state,city,product,price_per_unit,units_sold,total_sales,operating_profit,sales_method
1,Foot Locker,1185732,2020-01-01,Northeast,Pennsylvania,Philadelphia,Women's Apparel,68,83,5644,2426.92,Online
2,Foot Locker,1185732,2020-01-01,Northeast,Pennsylvania,Philadelphia,Women's Apparel,75,275,206250,61875.00,Outlet
4,Foot Locker,1185732,2020-01-01,Northeast,Pennsylvania,Philadelphia,Women's Apparel,53,83,4399,1407.68,Outlet
31,Foot Locker,1185732,2020-01-06,Northeast,New York,New York,Women's Apparel,46,260,11960,4425.20,Online
32,Foot Locker,1185732,2020-01-06,Northeast,New York,New York,Women's Apparel,50,1000,500000,125000.00,In-store
...,...,...,...,...,...,...,...,...,...,...,...,...
8316,Foot Locker,1185732,2021-12-26,Northeast,Pennsylvania,Philadelphia,Women's Apparel,53,75,3975,1431.00,Outlet
8317,Amazon,1185732,2021-12-26,Northeast,Maine,Portland,Women's Apparel,60,325,195000,78000.00,Outlet
8318,Amazon,1185732,2021-12-26,Northeast,Maine,Portland,Women's Apparel,54,91,4914,2653.56,Online
8319,Foot Locker,1185732,2021-12-26,Northeast,Pennsylvania,Philadelphia,Women's Apparel,71,65,4615,2030.60,Online
8320,Foot Locker,1185732,2021-12-26,Northeast,Pennsylvania,Philadelphia,Women's Apparel,75,250,187500,56250.00,Outlet

#### Using `groupby`

In [20]:
# Show the total number of women's athletic footwear sold for each retailer, region, state, and city.
# Rename the "units_sold" column to "Womens_Footwear_Units_Sold"
AS_2020_2021_W_UNIT_GROUPBY = AS_2020_2021_W.groupby(["retailer","region", "state", "city"]).agg({"units_sold": "sum"})
AS_2020_2021_W_UNIT_GROUPBY.rename(columns={"units_sold": "Womens_Footwear_Units_Sold"}, inplace=True)

# Show the top 5 results.
AS_2020_2021_W_UNIT_GROUPBY.sort_values("Womens_Footwear_Units_Sold", ascending=False).head(5)

                                               Womens_Footwear_Units_Sold
retailer      region state      city
West Gear     West   California San Francisco                       14480
Sports Direct South  Texas      Dallas                              13056
Kohl's        West   California Los Angeles                         12968
Walmart       South  Texas      Houston                             12797
Sports Direct South  Tennessee  Knoxville                           12345

#### Using `pivot_table`

In [21]:
# Show the total number of women's athletic footwear sold for each retailer, region, state, and city.
AS_2020_2021_W_UNIT_PIVOT = pd.pivot_table(AS_2020_2021_W, index=["retailer","region", "state", "city"], values=["units_sold"], aggfunc=sum)


# Rename the "units_sold" column to "Womens_Footwear_Units_Sold"
AS_2020_2021_W_UNIT_PIVOT.rename(columns={"units_sold": "Womens_Footwear_Units_Sold"}, inplace=True)

# Show the top 5 results.
AS_2020_2021_W_UNIT_PIVOT.sort_values("Womens_Footwear_Units_Sold", ascending=False).head(5)

C:\Users\richv\AppData\Local\Temp\ipykernel_34180\515533001.py:2: FutureWarning: The provided callable <built-in function sum> is currently using DataFrameGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  AS_2020_2021_W_UNIT_PIVOT = pd.pivot_table(AS_2020_2021_W, index=["retailer","region", "state", "city"], values=["units_sold"], aggfunc=sum)

                                               Womens_Footwear_Units_Sold
retailer      region state      city
West Gear     West   California San Francisco                       14480
Sports Direct South  Texas      Dallas                              13056
Kohl's        West   California Los Angeles                         12968
Walmart       South  Texas      Houston                             12797
Sports Direct South  Tennessee  Knoxville                           12345

### 5. Determine the Day with the Most Women's Athletic Footwear Sales

In [22]:
# Create a pivot table with the 'invoice_date' column is the index, and the "total_sales" as the values.
AS_2020_2021_W_PIVOT_TABLE = pd.pivot_table(AS_2020_2021_W, index=["invoice_date"], values=["total_sales"], aggfunc=sum)


# Optional: Rename the "total_sales" column to "Total Sales"
AS_2020_2021_W_PIVOT_TABLE.rename(columns={"total_sales": "Total Sales"}, inplace=True)

# Show the table.
AS_2020_2021_W_PIVOT_TABLE.sort_values("Total Sales", ascending=False).head(1)

C:\Users\richv\AppData\Local\Temp\ipykernel_34180\1860698214.py:2: FutureWarning: The provided callable <built-in function sum> is currently using DataFrameGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  AS_2020_2021_W_PIVOT_TABLE = pd.pivot_table(AS_2020_2021_W, index=["invoice_date"], values=["total_sales"], aggfunc=sum)

              Total Sales
invoice_date
2021-06-17        2577406

In [23]:
# Resample the pivot table into daily bins, and get the total sales for each day.
AS_2020_2021_W_PIVOT_TABLE.resample("D").sum()


# Sort the resampled pivot table in ascending order on "Total Sales".
(AS_2020_2021_W_PIVOT_TABLE.resample("D").sum()).sort_values("Total Sales", ascending=False).head(10)

              Total Sales
invoice_date
2021-06-17        2577406
2021-07-16        2271581
2021-12-16        1983497
2021-11-17        1802076
2020-04-24        1603544
2021-06-24        1541463
2021-07-23        1464363
2021-05-18        1454606
2021-01-17        1452682
2021-06-10        1386478

### 6.  Determine the Week with the Most Women's Athletic Footwear Sales

In [24]:
# Resample the pivot table into weekly bins, and get the total sales for each week.
AS_2020_2021_W_PIVOT_TABLE.resample("W").sum()


# Sort the resampled pivot table in ascending order on "Total Sales".
(AS_2020_2021_W_PIVOT_TABLE.resample("W").sum()).sort_values("Total Sales", ascending=False).head(10)

              Total Sales
invoice_date
2021-07-11        5774816
2021-07-18        4917531
2021-06-13        4910057
2021-12-19        4709095
2021-12-12        4517329
2021-06-20        4473058
2021-11-21        4429156
2021-11-14        4337252
2021-05-16        4072418
2021-06-27        4027704